[
  {
    "termin": "Веб-разработка",
    "definition": "Процесс создания веб-сайтов и веб-приложений с использованием широкого спектра языков программирования и инструментов, включающий в себя различные виды деятельности, такие как проектирование, кодирование, тестирование, отладка и обеспечение безопасности."
  },
  {
    "termin": "Библиотека",
    "definition": "Совокупность подпрограмм, функций и классов, собранных в одном модуле, которые могут быть использованы при разработке программного обеспечения для решения различных задач."
  },
  {
    "termin": "WebGL",
    "definition": "(Web Graphics Library) программная библиотека для языка JavaScript предназначенная для визуализации интерактивной трёхмерной графики и двухмерной графики в пределах совместимости веб-браузера без использования плагинов."
  },
  {
    "termin": "Three.js",
    "definition": "Кроссбраузерная библиотека JavaScript, основанная на WebGL и содержащая набор готовых классов для создания и отображения анимированной компьютерной 3D графики при разработке веб-приложений."
  },
  {
    "termin": "3D-графика",
    "definition": "Визуальное представление трехмерных объектов, поверхностей и сцен с помощью компьютерных технологий, которое создает иллюзию глубины и позволяет зрителю воспринимать изображение в трех измерениях: ширине, высоте и глубине. "
  },
  {
    "termin": "Браузер",
    "definition": "Прикладное программное обеспечение для просмотра страниц, содержания веб-документов, компьютерных файлов и их каталогов, управления веб-приложениями, а также для решения других задач."
  },
  {
    "termin": "Веб-сайт ",
    "definition": "Cовокупность веб-страниц и связанного с ними контента, который идентифицируется общим доменным именем и публикуется по крайней мере на одном веб-сервере."
  },
  {
    "termin": "Производительность отрисовки",
    "definition": "Показатель, который измеряет скорость и эффективность обработки графических данных во время процесса визуализации 3D-моделей и анимаций. Он определяет количество кадров в секунду (FPS), которые могут быть обработаны системой при визуализации сложных сцен или высоком разрешении."
  },
  {
    "termin": "Бэнчмарк-сервис",
    "definition": "Сервис для измерения производительности браузеров, использующие различные тесты и сценарии, чтобы оценить скорость работы браузера, его потребление ресурсов (память, процессор, батарея и т.д.), а также его совместимость с различными веб-стандартами и технологиями."
  },
  {
    "termin": "Stats.js",
    "definition": "Небольшая библиотека, предназначенная для создания графиков и отображения статистики производительности в реальном времени на веб-страницах. Она особенно полезна при разработке веб-приложений с использованием трехмерной графики и помогает отслеживать такие показатели, как FPS, память и время рендеринга."
  },
  {
    "termin": "GPUStatsPanel.js",
    "definition": "JavaScript библиотека, которая позволяет получить информацию об аппаратном обеспечении компьютера, в частности о графическом процессоре (GPU)."
  },
  {
    "termin": "FPS",
    "definition": "(Frames per second) - количество сменяемых кадров за одну секунду, показывающее скорость обработки графики в видеоиграх или других визуализируемых приложениях."
  },
  {
    "termin": "GPU",
    "definition": "(Graphics Processing Unit) отдельное устройство персонального компьютера, выполняющее графический рендеринг."
  },
  {
    "termin": "Web Vitals",
    "definition": "Набор инструментов и показателей для измерения производительности и пользовательского опыта на веб-сайтах."
  }
]
